{
    "_comment_general": [
        "This is the configuration file for FruitTycoon. You need to edit this file",
        "to setup the bot. Do not edit this file using Notepad as it messes with",
        "the formatting - use Notepad++ or a code editor like Visual Studio Code.",
        
        "To get IDs, enable Developer Mode (Options -> Settings -> Appearance)",
        "on Discord and then right-click the person/channel you want to get the",
        "channel of, then click 'Copy ID'. You can also use the 'listids' command."],
        
    "credentials": {
        "_comment_token": [
            "This is your Discord bot account token.",
            "Find your bot's token here: https://discordapp.com/developers/applications/me/",
            "Create a new application, with no redirect URI or boxes ticked.",
            "Then click 'Create Bot User' on the application page and copy the token here."],
        "token": "",
        
        "_comment_owner_id": "",
        "owner_id": ""
    },

    "chat": {
        "_comment_prefix": [
            "Determines the prefix that must be used before commands in the Discord chat.",
            "e.g if you set this to *, the help command would be triggered using *help."],
        "prefix": "",

        "_comment_btc": [
            "Restricts the bot to only listening to certain text channels. To use this, add",
            "the IDs of the text channels you would like the bot to listen to, seperated by",
            "a space."],
        "bind_to_channels": []
    },

    "bot": {
        "_comment_debug_level": [
            "Determines what messages are logged to the console. Defaults to INFO, which is",
            "everything a regular user would need. Other levels include: DEBUG, WARNING,",
            "ERROR, CRITICAL. Only change this if you are debugging or if you want a",
            "quieter console output."],
        "debug_level": "DEBUG",

        "_comment_ddm": [
            "Determines if discord should send messages to the console. Defaults to false.",
            "Usefull if debugging however can become very noisy. It is recommended that",
            "you only change it if you are debugging."],
        "discord_debug_mode": false
    }

}